
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетПоАренде Расход
	Движения.РасчетПоАренде.Записывать = Истина;
	Движение = Движения.РасчетПоАренде.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Мастер = Мастер;
	Движение.Полка = Полка;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачисленияАренды") Тогда
		// оплачиваем первую строку начисления
		Если ДанныеЗаполнения.Начисления.Количество() > 0 Тогда
			ПерваяСтрока = ДанныеЗаполнения.Начисления.Получить(0);
			Мастер = ПерваяСтрока.Мастер;
			Полка = ПерваяСтрока.Полка;
			Сумма = ПерваяСтрока.Сумма;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
