Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр РасчетыСМастерами Расход
	Движения.РасчетыСМастерами.Записывать = Истина;
	Движение = Движения.РасчетыСМастерами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Мастер = Мастер;
	Движение.Сумма = Сумма;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажа") Тогда
		// берем сумму долга мастера, начисленную проведением продажи
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыСМастерами.Мастер КАК Мастер,
		|	СУММА(РасчетыСМастерами.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСМастерами КАК РасчетыСМастерами
		|ГДЕ
		|	РасчетыСМастерами.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСМастерами.Мастер";
		Запрос.УстановитьПараметр("Регистратор", ДанныеЗаполнения);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Мастер = Выборка.Мастер;
			Сумма = Выборка.Сумма;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
