
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетПоАренде Приход
	Движения.РасчетПоАренде.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.РасчетПоАренде.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Мастер = ТекСтрокаНачисления.Мастер;
		Движение.Полка = ТекСтрокаНачисления.Полка;
		Движение.Сумма = ТекСтрокаНачисления.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорАрендыПолки") Тогда
		// начисляем аренду по полкам договора
		Месяц = НачалоМесяца(ДанныеЗаполнения.ДатаНачала);
		Для Каждого ТекСтрокаПолки Из ДанныеЗаполнения.Полки Цикл
			НоваяСтрока = Начисления.Добавить();
			НоваяСтрока.Мастер = ДанныеЗаполнения.Мастер;
			НоваяСтрока.Полка = ТекСтрокаПолки.Полка;
			НоваяСтрока.Сумма = ТекСтрокаПолки.СтоимостьЗаМесяц;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
